Revit 2026 API

# ThermalAssetThermalConductivity Property

---

The thermal conductivity of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ThermalConductivity { get; set; }
```
```vb
Public Property ThermalConductivity As Double
	Get
	Set
```
```cpp
public:
property double ThermalConductivity {
	double get ();
	void set (double value);
}
```
```fsharp
member ThermalConductivity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for thermalConductivity must be non-negative. |

Values are in feet-kilograms per Kelvin-cubed-second ((ft · kg)/(K · s³)) and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace